export const rulesDate = {
  1: {
    lotteryname: "PC蛋蛋",
    title: "PC蛋蛋玩法",
    data: [
      {
        question: "PC蛋蛋的游戏时间是多少?",
        answer: ["09:05至23:55；每5分钟1期，每天开奖179期。"]
      },
      {
        question: "PC蛋蛋的游戏简介？",
        answer: ["该游戏开奖结果来源于中国福利彩票北京快乐8（官网），北京快乐8每期开奖共开出20个数字，PC蛋蛋将这个20个开奖号码按照由小到大的顺序依次排列。<br/>取其1-6位开奖号码相加，和值的末位数作为PC蛋蛋开奖第一区数值；<br/>取其7-12位开奖号码相加，和值的末位数作为PC蛋蛋开奖第二区数值；<br/>取其13-18位开奖号码相加，和值的末位数作为PC蛋蛋开奖第三区数值。<br/>三个区数值个位相加即为PC蛋蛋最终的开奖结果。"]
      },
      {
        question: "PC蛋蛋规则里面的特码指什么？",
        answer: ["3个区数值相加的结果作为特码,例：4+3+0=7。"]
      },
      {
        question: "PC蛋蛋规则里面的大小单双分别指什么？",
        answer: ["0-13为小，14-27为大。", "单双：开出的号码为双数叫双，例：0,2,4,6,8,10； 开出的号码为单数叫单，例：1,3,5,7,9,11。<br/>大单大双：开出的号码≥14为大且为双数，例：14（大双）15（大单）。<br/>小单小双：开出的号码≤13为小且为单数，例：13（小单）12（小双）。"]
      },
      {
        question: "PC蛋蛋规则里面的极大极小分别指什么？",
        answer: ["开出的号码≤5（0-5）则为极小，开出的号码≥22（22-27）则为极大。"]
      },
      {
        question: "PC蛋蛋规则里面的波色豹子分别指什么？",
        answer: ["绿波号码（1,4,7,10,16,19,22,25）,蓝波号码（2,5,8,11,17,20,23,26）；<br/>红波号码（3,6,9,12,15,18,21,24），无波色（0,13,14,27）,开出的号码为无波色，视为不中。<br/>豹子：3个区数值号码相同，即为豹子，例：5+5+5。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  2: {
    lotteryname: "加拿大幸运28",
    title: "加拿大幸运28玩法",
    data: [
      {
        question: "加拿大幸运28的游戏时间是多少？",
        answer: ["（21:00至次日20:00）为正常销售时间，每3.30分钟一期。20:00-21:00（大约）为系统维护时间，具体情况依据加拿大28官方开售时间为准。"]
      },
      {
        question: "加拿大幸运28的游戏简介？",
        answer: ["该游戏开奖结果来源于加拿大KENO福利彩票（官网），每期开奖共开出20个数字，加拿大幸运28将这个20个开奖号码按照由小到大的顺序依次排列。<br/>取其2、5、8、11、14、17位开奖号码相加，和值的末位数作为加拿大28开奖第一区数值；<br/>取其3、6、9、12、15、18位开奖号码相加，和值的末位数作为加拿大28开奖第二区数值；<br/>取其4、7、10、13、16、19位开奖号码相加，和值的末位数作为加拿大28开奖第三区数值。<br/>三个区数值相加即为加拿大28最终的开奖结果。"]
      },
      {
        question: "加拿大幸运28规则里面的特码指什么？",
        answer: ["3个区数值相加的结果作为特码,例：4+3+0=7。"]
      },
      {
        question: "加拿大幸运28规则里面的大小单双分别指什么？",
        answer: ["0-13为小，14-27为大。", "单双：开出的号码为双数叫双，例：0,2,4,6,8,10； 开出的号码为单数叫单，例：1,3,5,7,9,11。<br/>大单大双：开出的号码≥14为大且为双数，例：14（大双）15（大单）。<br/>小单小双：开出的号码≤13为小且为单数，例：13（小单）12（小双）。"]
      },
      {
        question: "加拿大幸运28规则里面的极大极小分别指什么？",
        answer: ["开出的号码≤5（0-5）则为极小，开出的号码≥22（22-27）则为极大。"]
      },
      {
        question: "加拿大幸运28规则里面的波色豹子分别指什么？",
        answer: ["绿波号码（1,4,7,10,16,19,22,25）,蓝波号码（2,5,8,11,17,20,23,26）；<br/>红波号码（3,6,9,12,15,18,21,24），无波色（0,13,14,27）,开出的号码为无波色，视为不中。<br/>豹子：3个区数值号码相同，即为豹子，例：5+5+5。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  3: {
    lotteryname: "香港新六合彩",
    title: "香港新六合彩玩法",
    data: [
      {
        question: "香港六合彩的游戏时间是多少？",
        answer: ["（21:00至次日20:00）为正常销售时间，每3.30分钟一期。20:00-21:00（大约）为系统维护时间，具体情况依据加拿大28官方开售时间为准。"]
      },
      {
        question: "香港新六合彩规则里面的游戏简介？",
        answer: ["该游戏开奖结果来源于加拿大KENO福利彩票（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。<br/>例：2207408期开奖号码为：【4,9,10,14,18,25,29,31,34,36,37,42,43,46,<br/>53,54,61,63,66,68】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*20个号码和值）将20个开奖号码重新排列。取排序后的前7个开奖号码除以49取余数作为第2207408期开奖结果。"]
      },
      {
        question: "香港新六合彩规则里面的特码、正码指什么？",
        answer: ["特码指每期开奖球数共7粒，当期开出的最后一个号码为特码。<br/>正码：当期开出前6个号码为正码，每一个号码为一投注组合，投注号码为开奖号码之正码，视为中。"]
      },
      {
        question: "香港新六合彩规则里面的生肖指什么？",
        answer: ["生肖包括特肖、一肖<br/>特肖：以特码和生肖为一个投注组合，当开出的特肖出现在其投注组合中，即视为中奖。<br/>一肖：指开出的7个开奖号码中含有所投注生肖的一个或多个号码，即视为中奖。<br/>依据六合彩惯例每年需向下顺延一次生肖所对应的号码（调整时间为每年的农历初一）。如今年是鸡年，就以鸡为开始，依顺序将49个号码分为12个生肖（如下），再以生肖下注，若当期特码落在下注生肖范围内，则视为中奖。<br/>鼠包括： 10,22,34,46<br/>牛包括： 9,21,33,45<br/>虎包括： 8,20,32,44<br/>兔包括： 7,19,31,43<br/>龙包括： 6,18,30,42<br/>蛇包括： 5,17,29,41<br/>马包括： 4,16,28,40<br/>羊包括： 3,15,27,39<br/>猴包括： 2,14,26,38<br/>鸡包括： 1,13,25,37,49<br/>狗包括： 12,24,36,48<br/>猪包括： 11,23,35,47"]
      },
      {
        question: "香港新六合彩规则里面的半波指什么？",
        answer: ["半波指以特码色波和特码大小单双为一个组合，当期特码开出符合投注组合,即视为中奖。若当期特码开出49号，则视为和局；球色号码分布如下:<br/>红色：01 02 07 08 12 13 18 19 23 24 29 30 34 35 40 45 46<br/>蓝色：03 04 09 10 14 15 20 25 26 31 36 37 41 42 47 48<br/>绿色：05 06 11 16 17 21 22 27 28 32 33 38 39 43 44 49"]
      },
      {
        question: "香港新六合彩规则里面的尾数指什么？",
        answer: ["对尾数相同的号码进行组合投注。"]
      },
      {
        question: "香港新六合彩规则里面的总分指什么？",
        answer: ["总分包括总分大小、总分单双<br/>总分大小：指7个开奖号码相加的总和大于或等于175为总大，总和小于或等于174为总小。<br/>总分单双：指7个开奖号码相加的总和尾数单数为总单，总和尾数双数为总双。"]
      },
      {
        question: "香港新六合彩规则里面的龙虎斗指什么？",
        answer: ["正码一”号码大于“正码二”视为【龙】中奖，反之小于视为【虎】中奖，如龙和虎点数两者点数中有49则为打和。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  4: {
    lotteryname: "江苏快3",
    title: "江苏快3玩法",
    data: [
      {
        question: "江苏快3的游戏时间是多少？",
        answer: ["08:30至22:10；每10分钟1期。"]
      },
      {
        question: "江苏快3的游戏简介？",
        answer: ["该游戏开奖结果是由中国福利彩票发行管理中心组织销售、江苏省福利彩票发行中心承销,每期开出3个号码、每个号码范围01~06。"]
      },
      {
        question: "江苏快3规则里面的大小指什么？",
        answer: ["三个开奖号码总和值11~17为大,总和值4~10为小,若三个号码相同、则不算中奖。"]
      },
      {
        question: "江苏快3规则里面的围骰指什么？",
        answer: ["三个开奖号码的点数相同，且与所选点数也相同。"]
      },
      {
        question: "江苏快3规则里面的全骰指什么？",
        answer: ["三个开奖号码相同。"]
      },
      {
        question: "江苏快3规则里面的单点指什么？",
        answer: ["三个开奖号码其中一个与所选号码相同时、即为中奖。"]
      },
      {
        question: "江苏快3规则里面的点数指什么？",
        answer: ["开奖号码总和值为4-17，任选一和值进行投注,不包含豹子。"]
      },
      {
        question: "江苏快3规则里面的长牌指什么？",
        answer: ["当开奖结果任意两个号码与所选组合相同时,即为中奖。例如中奖点数为123，中奖点数的两颗之点数与所选的点数\"12\",\"23\",\"13\"相同时，视为中奖，其它视为不中奖。"]
      },
      {
        question: "江苏快3规则里面的短牌指什么？",
        answer: ["开奖号码任两字同号、且与所选择的短牌组合相符时，即为中奖。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  5: {
    lotteryname: "北京PK10",
    title: "北京PK10玩法",
    data: [
      {
        question: "北京PK10的游戏时间是多少？",
        answer: ["09:02至23:57；每5分钟一期，每天开奖179期。"]
      },
      {
        question: "北京PK10的游戏简介？",
        answer: ["该游戏开奖结果是由中国福利彩票北京PK10（官网），北京福利彩票发行中心承销。"]
      },
      {
        question: "北京PK10规则里面的两面指什么？",
        answer: ["两面指单、双；大，小。<br/>单双：号码为双数叫双、例：2,4  号码为单数叫单、例：1,3。<br/>大小：开出之号码≥6为大，≤5为小。\n"]
      },
      {
        question: "北京PK10规则里面的第一名～第十名指什么？",
        answer: ["第一名～第十名车号指定：每一个车号为一投注组合，开奖结果\"投注车号\"对应所投名次视为中奖。"]
      },
      {
        question: "北京PK10规则里面的龙虎指什么？",
        answer: ["龙虎：冠军、“第一名”车号大于“第十名”车号视为【龙】中奖，反之小于视为【虎】中奖，亚军、“第二名”车号大于“第九号”车号视为【龙】中奖，反之小于视为【虎】中奖，（第三名，第四名，第五名以此类推计算）。"]
      },
      {
        question: "北京PK10规则里面的冠亚和指什么？",
        answer: ["冠亚和指冠亚和值、冠亚军和大小、冠亚军和单双<br/>冠亚和值：冠军+亚军的和值视为中奖号码，可出现结果为3~19。<br/>冠亚和大小：“冠亚和值”大于11为大.小于11为小, 等于11的注单视为打和，（不计输赢）；和值为（13）即为和单，和值为（10）即为和双。<br/>冠亚和单双：“冠亚和值”号码为单叫单，例：3,5,7。“冠亚和值”号码为双叫双，例：4,6,8。<br/>冠亚组合：开出之号码顺序与所投注的两个号码相同即视为中奖。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  6: {
    lotteryname: "重庆时时彩",
    title: "重庆时时彩玩法",
    data: [
      {
        question: "重庆时时彩的游戏时间是多少？",
        answer: ["白场10:00至22:00每10分钟1期；夜场22:00至02:00每5分钟1期，每天开奖120期。"]
      },
      {
        question: "重庆时时彩的游戏简介？",
        answer: ["该游戏开奖结果是由中国福利彩票发行管理中心在重庆市所辖区域内发行，由重庆市福利彩票发行中心承销。"]
      },
      {
        question: "重庆时时彩规则里面的两面指什么？",
        answer: ["两面指单、双；大、小。<br/>单、双：号码为双数叫双，如0、2、4、6、8；号码为单数叫单，如1、3、5、7、9。<br/>大、小：开出之号码大于或等于5为大，小于或等于4为小。"]
      },
      {
        question: "重庆时时彩规则里面的整合指什么？",
        answer: ["整合：指下注的每一球与开出之号码其开奖顺序及开奖号码相同。"]
      },
      {
        question: "重庆时时彩规则里面的特殊号码指什么？",
        answer: ["特殊号码里面豹子：三个数字相同；顺子：三个号码相连，不分顺序（数字9、0、1相连）；对子：三个数字种任意两位数字相同（不包括豹子）；半顺：三个数字的任意两位数字相连，不分顺序（不包括顺子、对子，数字9、0、1相连）；杂六：不包括豹子、对子、顺子、半顺的其他号码。"]
      },
      {
        question: "重庆时时彩规则里面的龙虎斗指什么？",
        answer: ["龙虎斗：以龙和虎点数大小比较来判断胜负，龙大于虎则投注“龙”者中奖，如龙开8，虎开0，若龙小于虎则投注“虎”者中奖。开出号码一样为和。"]
      },
      {
        question: "重庆时时彩规则里面的总和指什么？",
        answer: ["总和指总和大小、总和单双。<br/>总和单双：所有5个开奖号码的数字总和值是单数为总和单，总和值是双数为总和双。<br/>总和大小：所有5个开奖号码的数字总和值23到45为总和大，总和值0到22为总和小。<br/>全5中1：0~9任选1号进行投注，当所有5个开奖号码中任一数与所选的号码相同时，即为中奖。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  12: {
    lotteryname: "香港六合彩",
    title: "香港六合彩玩法",
    data: [
      {
        question: "香港六合彩的游戏时间是多少？",
        answer: ["每周二、四、六（日）21:35"]
      },
      {
        question: "香港新六合彩规则里面的游戏简介？",
        answer: ["该游戏开奖结果来源于香港赛马会-六合彩（官网），香港六合彩每期开奖号码由49个号码中开出7个号码作为开奖结果，当期开出的最后一位号码为特码。"]
      },
      {
        question: "香港新六合彩规则里面的特码、正码指什么？",
        answer: ["特码指每期开奖球数共7粒，当期开出的最后一个号码为特码。<br/>正码：当期开出前6个号码为正码，每一个号码为一投注组合，投注号码为开奖号码之正码，视为中。\n"]
      },
      {
        question: "香港新六合彩规则里面的生肖指什么？",
        answer: ["生肖包括特肖、一肖<br/>特肖：以特码和生肖为一个投注组合，当开出的特肖出现在其投注组合中，即视为中奖。<br/>一肖：指开出的7个开奖号码中含有所投注生肖的一个或多个号码，即视为中奖。<br/>依据六合彩惯例每年需向下顺延一次生肖所对应的号码（调整时间为每年的农历初一）。如今年是鸡年，就以鸡为开始，依顺序将49个号码分为12个生肖（如下），再以生肖下注，若当期特码落在下注生肖范围内，则视为中奖。<br/>鼠包括： 10,22,34,46<br/>牛包括： 9,21,33,45<br/>虎包括： 8,20,32,44<br/>兔包括： 7,19,31,43<br/>龙包括： 6,18,30,42<br/>蛇包括： 5,17,29,41<br/>马包括： 4,16,28,40<br/>羊包括： 3,15,27,39<br/>猴包括： 2,14,26,38<br/>鸡包括： 1,13,25,37,49<br/>狗包括： 12,24,36,48<br/>猪包括： 11,23,35,47"]
      },
      {
        question: "香港新六合彩规则里面的半波指什么？",
        answer: ["半波指以特码色波和特码大小单双为一个组合，当期特码开出符合投注组合,即视为中奖。若当期特码开出49号，则视为和局；球色号码分布如下:<br/>红色：01 02 07 08 12 13 18 19 23 24 29 30 34 35 40 45 46<br/>蓝色：03 04 09 10 14 15 20 25 26 31 36 37 41 42 47 48<br/>绿色：05 06 11 16 17 21 22 27 28 32 33 38 39 43 44 49"]
      },
      {
        question: "香港新六合彩规则里面的尾数指什么？",
        answer: ["对尾数相同的成组号码进行组合投注。"]
      },
      {
        question: "香港新六合彩规则里面的总分指什么？",
        answer: ["总分包括总分大小、总分单双<br/>总分大小：指7个开奖号码相加的总和大于或等于175为总大，总和小于或等于174为总小。<br/>总分单双：指7个开奖号码相加的总和尾数单数为总单，总和尾数双数为总双。"]
      },
      {
        question: "香港新六合彩规则里面的龙虎斗指什么？",
        answer: ["正码一”号码大于“正码二”视为【龙】中奖，反之小于视为【虎】中奖，如龙和虎点数两者点数中有49则为打和。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  13: {
    lotteryname: "俄罗斯轮盘",
    title: "俄罗斯轮盘玩法",
    data: [
      {
        question: "俄罗斯轮盘的游戏时间是多少？",
        answer: ["（21:00至次日20:00）为正常销售时间，每3.30分钟一期。20:00-21:00（大约）为系统维护时间，具体情况依据加拿大28官方开售时间为准。"]
      },
      {
        question: "俄罗斯轮盘规则里面的游戏简介？",
        answer: ["该游戏开奖结果来源于加拿大KENO福利彩票（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。例：2207408期开奖号码为：<br/>【4,9,10,14,18,25,29,31,34,36,37,42,43,46,<br/>53,54,61,63,66,68】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*20个号码和值）将20个开奖号码重新排列。取排序后的最后一位开奖号码除以37取余数作为俄罗斯2207408期开奖结果。"]
      },
      {
        question: "俄罗斯轮盘规则里面的单数及大小单双分别指什么？",
        answer: ["单数指开出之号码与投注号码相同即视为中奖；<br/>大小：开出之号码≥19为大，≤18为小（不包括0）；<br/>单双：开出之号码末位数单数为单，开出之号码末位数双数为双（不包括0）；<br/>若开出数字为0，视为未中奖；"]
      },
      {
        question: "俄罗斯轮盘规则里面的红黑绿分别指什么？",
        answer: ["黑色球号码为：2,4,6,8,10,11,13,15,17,20,<br/>22,24,26,28,29,31,33,35 <br/>红色球号码为：1,3,5,7,9,12,14,16,18,19,<br/>21,23,25,27,30,32,34,36  <br/>绿色球号码为：0"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  14: {
    lotteryname: "济州岛赛马",
    title: "济州岛赛马玩法",
    data: [
      {
        question: "济州岛赛马的游戏时间是多少？",
        answer: ["09:00至23:00，每10分钟1期。"]
      },
      {
        question: "济州岛赛马规则里面的游戏简介？",
        answer: ["该游戏开奖结果来源于湖南体彩湖南幸运赛车（官网），湖南体育彩票发行中心承销。济州岛赛马的开奖结果来源于湖南幸运赛车的前3位开奖号码。"]
      },
      {
        question: "济州岛赛马规则里面的整合指什么？",
        answer: ["对当期12匹赛马中可能获得【冠军】【亚军】【季军】进行投注。"]
      },
      {
        question: "济州岛赛马规则里面的大小单双分别指什么？",
        answer: ["大小：1-6为小，7-12为大。<br/>单双：开出的号码为双数叫双，例：2,4,6,8,10,12;开出的号码为单数叫单，例：1,3,5,7,9,11。<br/>小单：开出的号码是奇数中的小号码：1,3,5即为小单。<br/>小双：开出的号码是偶数中的小号码：2,4,6即为小双。<br/>大单：开出的号码是奇数中的大号码：7,9,11即为大单。<br/>大双：开出的号码是偶数中的大号码：8,10,12即为大双。"]
      },
      {
        question: "济州岛赛马规则里面的颜色指什么？",
        answer: ["开出的号码颜色于所投注号码的颜色相同即为赢。<br/>1.2为白色，3.4为黑色，5.6为红色，7.8为黄色，9.10为褐色，11.12为蓝色。"]
      },
    
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  15: {
    lotteryname: "马尼拉梭哈",
    title: "马尼拉梭哈玩法",
    data: [
      {
        question: "马尼拉梭哈的游戏时间是多少？",
        answer: ["00:00至23:59 每4.5分钟一期。"]
      },
      {
        question: "马尼拉梭哈里面的游戏简介？",
        answer: ["该游戏开奖结果来源于韩国快乐8（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。例：0980103期开奖号码为：<br/>【27,57,28,22,29,66,51,34,68,69,49,15,14,46,<br/>12,39,45,6,44,10,43,42】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*22个号码和值)将22个开奖号码重新排列。取排序后的前5个开奖号码所映射的扑克牌作为第20171101212期开奖结果。<br/>将52张扑克牌进行排序编号；0、1、2、3、……51。红心A对应编号0，红心2对应编号1……；黑桃A对应编号13……；梅花 A对应编号26，以此类推……；方块A对应编号39，方块k对应编号51。牌面点数J、Q、K都是10点，A是当1点，2是当2点，其它的牌型当自身点数。五张牌里面任意三张牌凑成10点或者20点或者30点都可以，这样是被称为“牛”。再将其余的两张点数相加得出几点，去掉十位数，只留个位数进行比较，个位数是几点，就是牛几，这样的牌型就是 “斗牛”。"],
        ruleImgs: mnlashRuleImgs(),
      },
      {
        question: "马尼拉梭哈规则里面的通选分别指什么？",
        answer: ["根据相应开奖号码及其开奖顺序号码相同视为赢。【同花顺：同一种花色的顺子】【铁支：有四张同样大小的牌】【葫芦：三张大小一样的牌带一个对子】【同花：五张牌的花色相同】【顺子：五张相连的牌】【三条：有三张同样大小的牌】【两对：含有两个对子的牌】【对子：有两张同样大小的牌】【散牌：不能组合成以上牌型的牌】。"]
      },
      {
        question: "马尼拉梭哈规则里面的整合指什么？",
        answer: ["如第一张开奖号码为8，投注第一张为8则视为中奖;不考虑花色。"]
      },
      {
        question: "马尼拉梭哈规则里面的猜花色指什么？",
        answer: ["三个相同的花色或四个相同的花色为一组进行投注，若开奖结果中出现对应的花色即中奖，其余情形视为不中奖。"]
      },
      {
        question: "马尼拉梭哈规则里面的龙虎斗指什么？",
        answer: ["“第一张”号码大于“第二张”号码视为【龙】中奖，反之小于视为【虎】中奖，“第一张”号码大于“第三张”号码视为【龙】中奖，反之小于视为【虎】中奖，（第三名，第四名，第五名以此类推计算）；若两张号码相同则视为和；不考虑花色。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  16: {
    lotteryname: "云顶炸金花",
    title: "云顶炸金花玩法",
    data: [
      {
        question: "云顶炸金花的游戏时间是多少？",
        answer: ["（21:00至次日20:00）为正常销售时间，每3.30分钟一期。20:00-21:00（大约）为系统维护时间，具体情况依据加拿大28官方开售时间为准。"]
      },
      {
        question: "云顶炸金花里面的游戏简介？",
        answer: ["游戏简介：该游戏开奖结果来源于加拿大KENO福利彩票（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。<br/>例：2207408期开奖号码为：【4,9,10,14,18,25,29,31,34,36,37,42,43,46,<br/>53,54,61,63,66,68】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*20个号码和值)将20个开奖号码重新排列。取排序后的前5个开奖号码映射的扑克牌作为第20171101212期开奖结果。<br/>将52张扑克牌进行排序编号；0、1、2、3、……51。红心A对应编号0，红心2对应编号1……；黑桃A对应编号13……；梅花 A对应编号26，以此类推……；方块A对应编号39，方块k对应编号51。"],
        ruleImgs: mnlashRuleImgs(),
      },
      {
        question: "云顶炸金花规则里面的通选分别指什么？",
        answer: ["根据相应开奖号码及其开奖顺序号码相同；【豹子: 三张点数相同的牌】【顺金: 花色相同的顺子】【金花: 花色相同的牌】【对子: 两张点相同的牌】【顺子:三张相连的牌【散排: 不能排成以上组合的牌】。"]
      },
      {
        question: "云顶炸金花规则里面的整合分别指什么？",
        answer: ["：每张扑克牌为一投注组合，如第一张开奖号码为8，投注第一张为8号则视为中奖，不考虑花色。"]
      },
      {
        question: "云顶炸金花规则里面的全3中1分别指什么？",
        answer: ["A~K任选一张牌形进行投注，当所有开奖号码中任一数与所选的号码相同即为中奖，不考虑花色。"]
      },
      {
        question: "云顶炸金花规则里面的龙虎斗指什么？",
        answer: ["A：“第一张”号码大于“第二张”号码视为【龙】中奖，反之小于视为【虎】中奖，“第一张”号码大于“第三张”号码视为【龙】中奖，反之小于视为【虎】中奖，若2张开奖号码相同则视为和，不考虑花色。"]
      },
    
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  17: {
    lotteryname: "苏格兰农场",
    title: "苏格兰农场玩法",
    data: [
      {
        question: "苏格兰农场的游戏时间是多少？",
        answer: ["（21:00至次日20:00）为正常销售时间，每3.30分钟一期。20:00-21:00（大约）为系统维护时间，具体情况依据加拿大28官方开售时间为准。"]
      },
      {
        question: "苏格兰农场里面的游戏简介？",
        answer: ["该游戏开奖结果来源于加拿大KENO福利彩票（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。<br/>例：2207408期开奖号码为：【4,9,10,14,18,25,29,31,34,36,37,42,43,46,<br/>53,54,61,63,66,68】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*20个号码和值)将20个开奖号码从新排列。取排序后的前1个开奖号码减去20直到≤20作为第22071312期开奖结果。<br/>将20种水果进行编号，编号如下："],
        ruleImgs:farmRuleImgs(),
      },
      {
        question: "苏格兰农场规则里面的具体水果类型包括什么？",
        answer: ["依顺序将20个物种分为5个区域，再以区域进行投注，若当期开奖结果落在下注区域范围内，则视为中奖；<br/>大型水果：西瓜,椰子,榴莲,柚子,菠萝；<br/>中型水果：梨子,苹果,桃子,柑桔；<br/>小型水果：葡萄,荔枝,樱桃,草莓,番茄；<br/>蔬菜：冬瓜,萝卜,南瓜,茄子；<br/>农场动物：家犬,奶牛。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  18: {
    lotteryname: "PK牛牛",
    title: "PK牛牛玩法",
    data: [
      {
        question: "PK牛牛的游戏时间是多少？",
        answer: ["00:00至23:59；每4.30分钟1期"]
      },
      {
        question: "PK牛牛里面的游戏简介？",
        answer: ["该游戏开奖结果来源于日本东京快乐彩（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性；例：20171102568期开奖号码为：<br/>【1,6,7,10,22,23,26,30,39,44,45,46,<br/>50,51,53,58,70,74,77,80】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*22个号码和值)将22个开奖号码重新排列。取排序后的前5开奖号码映射的号码作为PK牛牛第20171102190期开奖结果。<br/>将52张扑克牌进行排序编号；0、1、2、3、……51。红心A对应编号0，红心2对应编号1……；黑桃A对应编号13……；梅花 A对应编号26，以此类推……；方块A对应编号39，方块k对应编号51。牌面点数J、Q、K都是10点，A是当1点，2是当2点，其它的牌型当自身点数。五张牌里面任意三张牌凑成10点或者20点或者30点都可以，这样是被称为“牛”。再将其余的两张点数相加得出几点，去掉十位数，只留个位数进行比较，个位数是几点，就是牛几，这样的牌型就是 “斗牛”。"],
        ruleImgs: mnlashRuleImgs(),
      },
      {
        question: "PK牛牛规则里面的通选包括什么？",
        answer: ["【五小牛：五张牌均小于5点，且牌点总数小于10】【金牛：五张花牌为金牛,J、Q、K是花牌】 【银牛：十和十以上的花牌组成的】【炸弹：有四张同样大小的牌】"]
      },
      {
        question: "PK牛牛规则里面的有牛、牛牛、无牛指什么？",
        answer: ["牛牛：任意三张牌和为10的整数倍，另外两张牌之和为10的整数倍。<br/>有牛：任意三张牌和为10的整数倍，如果另外两张牌之和不为10的整数倍，则根据这两张牌的个数位为该副牌的分数，为有牛牌，牛几。（牌形组合包括特殊的炸弹）<br/>无牛：任意三张牌之和不为10的整数倍，则判定该牌为无牛。"]
      },
      {
        question: "PK牛牛规则里面的整合指什么？",
        answer: ["每张扑克牌为一投注组合，开出之号码顺序及大小与所投注号码相同即视为赢；不考虑花色。"]
      },
      {
        question: "PK牛牛规则里面的猜花色指什么？",
        answer: ["对三张或四张花色相同的牌投注，开出之号码花色与所投注花色相同即视为赢。"]
      },
      {
        question: "PK牛牛规则里面的龙虎斗指什么？",
        answer: ["“第一张”号码大于“第二张”号码视为【龙】中奖，反之小于视为【虎】中奖；“第一张”号码大于“第三张”号码视为【龙】中奖，反之小于视为【虎】中奖，（以此类推计算）；龙虎点数相同即为和；不考虑花色。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  19: {
    lotteryname: "华夏牌九",
    title: "华夏牌九玩法",
    data: [
      {
        question: "华夏牌九的游戏时间是多少？",
        answer: ["00:00至23:59 每4.30分钟1期。"]
      },
      {
        question: "华夏牌九里面的游戏简介？",
        answer: ["该游戏开奖结果来源于韩国快乐8（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。例：0980103期开奖号码为：<br/>【27,57,28,22,29,66,51,34,68,69,49,15,14,46,<br/>12,39,45,6,44,10,43,42】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*22个号码和值)将20个开奖号码从新排列。取排序后的前8个开奖号码除以32取余数对应的牌作为第171105163期开奖结果。<br/>华夏牌九里面总共有32张牌，分别对32张牌进行编码，0、1号球对应华夏牌九的两张天牌，2、3号球对应华夏牌九的两张地牌，4、5号球对应华夏牌九的两张人牌，6、7号球对应华夏牌九的两张鹅牌，8、9号球对应华夏牌九的两张梅牌，……以此类推。"],
        ruleImgs: [hxpjruleImgs()[0]],
      },
      {
        question: "华夏牌九里面的具体游戏规则？",
        answer: ["具体游戏规则：<br/>在32只牌当中，有11种牌有两只，这种成双的牌称文牌或文子。<br/>天牌：红6点，白6点；  地牌：红2点；人牌：红8点；  <br/>鹅牌 ：红1点，白3点；  梅花：白10点；  <br/>长三：白6点；  板凳 ：白4点；   <br/>斧头：白11点；  红头十：红4点，白6点；<br/>高脚七：红1点，白6点；  零霖六：红1点，白5点。<br/>在32只牌当中，有10只牌没有成双。其中8只有点数相同，但图案不同的\"对应牌\"。而2种只有单独一只。这种牌共有10只，称武牌或武子。<br/>杂九：有两种，一红4白5，一白9点。<br/>杂八：有两种，都是白8点，但排列方式不同。<br/>杂七：有两种，一红4白3，一白7点。<br/>杂五：有两种，一红5点，一白5点。<br/>二四，大头六 6（可当3） 至尊牌之一，可当丁三用。<br/>麽鸡三，丁三 3（可当6） 至尊牌之一，可当二四用。"],
      },
      {
        question: "华夏牌九规则里面的猜庄、点数分别指什么？",
        answer: ["投注相应的牌型与开出的“第一张”号码与“第二张”号码一样即为中奖。"]
      },
      {
        question: "华夏牌九规则里面的比庄指什么？",
        answer: ["“初门”“天门”‘末门’开奖号码与“庄”相比大小。<br/>若没有以下的对牌,则以二牌之和的个位数分胜负.最大是9,最小是0。这也是牌九的名称由来，即排出九的数目之意。例:一天牌(12点)及一杂五(5点)的组合,二牌点数之和为12+5=17,个位数为7,所以点数是7。<br/>若双方对牌名称相同或点数遇到同点数，则为庄家赢。"],
        ruleImgs: [hxpjruleImgs()[1]],
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  20: {
    lotteryname: "皇家二八杠",
    title: "皇家二八杠玩法",
    data: [
      {
        question: "皇家二八杠的游戏时间是多少？",
        answer: ["00:00至23:59 每4.30分钟1期。"]
      },
      {
        question: "皇家二八杠里面的游戏简介？",
        answer: ["该游戏开奖结果来源于日本东京快乐彩（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。例：20171102568期开奖号码为：<br/>【1,6,7,10,22,23,26,30,39,44,45,46,<br/>50,51,53,58,70,74,77,80】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*22个号码和值）将20个开奖号码重新排列。取排序后的前8个开奖号码除以10取余数对应的牌作为第20171102190期开奖结果。<br/>对牌进行相应的编号，白板对应号码0，一饼对应号码1，二饼对应号码2……以此类推，相应九饼对应号码9。"],
        ruleImgs: hjebgRuleImgs(),
      },
      {
        question: "皇家二八杠规则里面的对子指什么？",
        answer: ["持有的二张牌相同，即为对子，白板对>9筒对>8筒对>……依次类推。"]
      },
      {
        question: "皇家二八杠规则里面的二八杠、点数、通半点分别指什么？",
        answer: ["二八杠：一张二筒和八筒的组合。点数：没有对牌和二八杠的牌形组合，则以二牌点数之和分胜负，小于10点直接比较。大于10需要减去10点后比较大小。白板为半点，一筒为1点，二筒为2点……9筒为9点。通半点：含有一个白板的牌型组合。"]
      },
      {
        question: "皇家二八杠规则里面的猜庄、比庄分别指什么？",
        answer: ["猜庄：投注相应的牌型与开出的“第一张”号码与“第二张”号码一样即为中奖。开出的“第一张”号码与“第二张”牌型组合：对子>二八杠>点数。<br/>比庄：“初门”“天门”‘末门’开奖号码与“庄”相比大小。若点数相同，则为庄家赢"]
      },
      {
        question: "皇家二八杠规则里面的任一指什么？",
        answer: ["任一：开出的“第一张”号码与“第二张”号码任一张牌与所投注号码相同即视为中奖。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  21: {
    lotteryname: "西部翻摊",
    title: "西部翻摊玩法",
    data: [
      {
        question: "西部番摊的游戏时间是多少？",
        answer: ["00:00至23:59 每4.30分钟1期。"]
      },
      {
        question: "西部番摊里面的游戏简介？",
        answer: ["该游戏开奖结果来源于韩国快乐8（官网）开奖号码经过国家福利彩票技术运算而成，保证开奖号码时效性与准确性。例：0980103期开奖号码为：<br/>【27,57,28,22,29,66,51,34,68,69,49,15,14,46,<br/>12,39,45,6,44,10,43,42】<br/>【详解】：国家福利彩票技术依照公式x=sin(x+x*22个号码和值)将22个开奖号码从新排列。取排序后的前1个开奖号码除以4取余数作为第171102163期开奖结果。"]
      },
      {
        question: "西部番摊规则里面的玩法指什么？",
        answer: ["对开奖号码1,2,3,4进行单独或组合投注。若开奖结果为3,那么投注2-3,3-4为赢，其余（1,2,4,1-4,1-2,1正点）视为未中奖；开1,2,4以此类推。<br/>单双：1,3为单，2,4为双。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  22: {
    lotteryname: "泳神争霸",
    title: "泳神争霸玩法",
    data: [
      {
        question: "泳神争霸的游戏时间是多少？",
        answer: ["09:00至22:10 每10分钟1期。"]
      },
      {
        question: "泳神争霸里面的游戏简介？",
        answer: ["该游戏开奖结果来源于浙江省快乐彩（官网），由浙江省福利彩票发行中心承销。<br/>泳神争霸的开奖结果来源于浙江快乐彩的前三位开奖号码。"]
      },
      {
        question: "泳神争霸规则里面的整合指什么？",
        answer: ["整合：对当期12名选手中可能获得“金牌”“银牌”“铜牌”的选手进行投注。<br/>两面：对当期“金牌”“银牌”“铜牌”得主进行大小单双投注。<br/>大小：开出之号码≥7为大，反之≤6为小。<br/>单双：开出之号码为双叫双，例：2,4 开出之号码为单叫单：例：3,5。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  23: {
    lotteryname: "广东11选5",
    title: "广东11选5玩法",
    data: [
      {
        question: "广东11选5的游戏时间是多少？",
        answer: ["09:22至23:00；每10分钟1期。"]
      },
      {
        question: "广东11选5里面的游戏简介？",
        answer: ["该游戏开奖结果是由国家体育总局发行，体育彩票管理中心承销。每次由1~11个号码随机摇出“5个”数字做为开奖号码；并依据押中的号码个数或玩法获得不同等级的奖金。"]
      },
      {
        question: "广东11选5规则里面的两面分别指什么？",
        answer: ["两面：指第一球,第二球,第三球,第四球,第五球为出现的顺序与号码为派彩依据。<br/>大小：开出之号码≥6为大，≤5为小。开出11为和局。<br/>单双：开出之号为双数叫双，例：2,4 开出之号码单数叫单，例：1,3。"]
      },
      {
        question: "广东11选5规则里面的整合指什么？",
        answer: ["指下注的每一球与开出之号码其开奖顺序及开奖号码相同。"]
      },
      {
        question: "广东11选5规则里面的龙虎斗指什么？",
        answer: ["“正码一”号码大于“正码二”号码视为【龙】中奖，反之小于视为【虎】中奖，“正码二”号码大于“正码三”号码视为【龙】中奖，反之小于视为【虎】中奖，（正码三，正码四、正码五  以此类推计算）。"]
      },
      {
        question: "广东11选5规则里面的总尾大小指什么？",
        answer: ["所有5个开奖号码的数字总和数值的个位数≥5为总尾大，≤4为总尾小。"]
      },
      {
        question: "广东11选5规则里面的组合分别指什么？",
        answer: ["组合：以全部开出的5个号码来判定。<br/>总大小：所有开奖号码数值相加总值大于30为总大，总值小于30为总小，总值30，退还本金；<br/>总单双：所有开奖号码数值相加总值尾数单为总单，总值尾数双为总双，总值30，退还本金。<br/>上和下盘：1-5为上盘号码，6-10为下盘号码。开出的前4个号码中:如上盘号码占多数（超过3个）时则上盘赢，反之如下盘号码占多数（超过3个）时则下盘赢。若4个号码中有一个号码为11则用第5个号码替换。<br/>奇和偶：开出的前4个号码中，如奇（单）数号码占多数（超过3个）则奇赢，如偶（双）数号码站多数（超过3个）则偶赢，如果奇数和偶数号码数目相同时（均为2个）则为和局；若前4个号码中有一个号码为11则用第5个号码替换。<br/>全5中1： 1~11任选1个号码进行投注，当所有开奖号码中任一数与投注号码相同时，即为中奖。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
  24: {
    lotteryname: "东京1.5分彩",
    title: "东京1.5分彩玩法",
    data: [
      {
        question: "东京1.5分彩的游戏时间是多少？",
        answer: ["00:00至23:00；每1.5分钟1期。"]
      },
      {
        question: "东京1.5分彩里面的游戏简介？",
        answer: ["该游戏开奖结果来源于日本东京快乐彩开奖号码经国家福利彩票运算而成，保证开奖号码时效性与准确性。开奖号码为1-80个球里面选取20个开奖号码,每20个开奖号码每连续4个开奖号码想加和的尾数，重新生成5个东京1.5分彩开奖号码。"]
      },
      {
        question: "东京1.5分彩规则里面的两面分别指什么？",
        answer: ["两面：指单、双；大、小。<br/>单、双：号码为双数叫双，如0、2、4、6、8；号码为单数叫单，如1、3、5、7、9。<br/>大、小：开出之号码大于或等于5为大，小于或等于4为小。"]
      },
      /*{
        question: "东京1.5分彩规则里面的总和分别指什么？",
        answer: ["五个开奖号码总和值是双数为总双，数值总和值是单数为总单；总和值号码大于或等于23为总大，总和值号码小于或等于22为总小。"]
      },*/
      {
        question: "东京1.5分彩规则里面的整合指什么？",
        answer: ["指下注的每一球与开出之号码其开奖顺序及开奖号码相同。"]
      },
      {
        question: "东京1.5分彩规则里面的特殊号码分别指什么？",
        answer: ["豹子：三个数字相同；顺子：三个号码相连，不分顺序（数字9、0、1相连）；对子：三个数字种任意两位数字相同（不包括豹子）；半顺：三个数字的任意两位数字相连，不分顺序（不包括顺子、对子，数字9、0、1相连）；杂六：不包括豹子、对子、顺子、半顺的其他号码。"]
      },
      {
        question: "东京1.5分彩规则里面的龙虎斗指什么？",
        answer: ["以龙和虎点数大小比较来判断胜负，龙大于虎则投注“龙”者中奖，如龙开8，虎开0，若龙小于虎则投注“虎”者中奖。开出号码一样为和。"]
      },
      {
        question: "东京1.5分彩规则里面的全5中1指什么？",
        answer: ["0~9任选1号进行投注，当所有5个开奖号码中任一数与所选的号码相同时，即为中奖。"]
      },
    ],
    footerdata: {
      content: "棋牌彩票官网www.qpcp.com<br>棋牌彩票官方客服QQ：97966666；客服微信：97966666<br>友情提示：客服QQ、微信是棋牌彩票唯一官方号码。"
    }
  },
}
/*马尼拉梭哈图片*/
function mnlashRuleImgs() {
  let arr = [];
  for (let i = 0; i < 52; i++) {
    arr.push({
      title: i,
      src: require('../../assets/images/showHand/sola/' + i + '.png')
    });
  }
  return arr;
}

function hjebgRuleImgs() {
  let arr = [];
  for (let i = 0; i < 10; i++) {
    arr.push({
      title: i,
      src: require('../../assets/images/Royal/img/' + i + '.png')
    });
  }
  return arr;
}

function hxpjruleImgs() {
  let arr = [];
  for (let i = 0; i < 2; i++) {
    arr.push({
      title: "",
      src: require('../../assets/images/paiGow/gupai' + i + '.png')
    });
  }
  return arr;
}

function farmRuleImgs() {
  let arr = [
    ["大型水果","小型水果"],
    [1,2,3,4,5,6,7,8,9,10],
    ["西瓜","椰子","榴莲","柚子","菠萝","葡萄","荔枝","樱桃","草莓","番茄"],
    ["中型水果","蔬菜","农场动物"],
    [11,12,13,14,15,16,17,18,19,20],
    ["梨子","苹果","桃子","柑桔","冬瓜","萝卜","南瓜","茄子","家犬","奶牛"],
  ];
  return arr;
}

/*
1: 'pcdd',
  2: 'jna28',
  3: 'xgxlhc',
  4: 'jsks',
  5: 'bjpk10',
  6: 'cqssc',
  12: 'xglhc',
  13: 'elslp',
  14: 'jzdsm',
  15: 'mnlsh',
  16: 'ydzjh',
  17: 'sglnc',
  18: 'pknn',
  19: 'hxpj',
  20: 'hjebg',
  21: 'xbft',
  22: 'mnlsh',
  23: 'gd11x5',
  24: 'dj1_5fc',*/
